{
  "configurationErrorRPCLinkMissing": "Configuration Error: RPC URL is missing. Set VITE_BASE_SEPOLIA_RPC_URL in your .env file.",
  "connectionSuccessfulNoAccounts": "Connection successful, but no accounts returned.",
  "connectionFailedGeneric": "Failed to connect Coinbase Wallet.",
  "connectionFailedUserRejected": "Connection request rejected by user.",
  "pleaseConnectWallet": "Please connect your Coinbase Wallet to continue.",
  "initializingWalletSDK": "Initializing Wallet SDK...",
  "connected": "Connected:",
  "disconnect": "Disconnect",
  "connecting": "Connecting...",
  "connectWallet": "Connect Wallet",
  "planetInfoTitle": "Planet Info",
  "planetInfoDescription": "Additional planet information or actions.",
  "baseSimulationUserChoseNo": "[Base Simulation] User chose not to start the historical simulation at this time.",

  "event_evt_001_info_freedom_title": "Information Freedom Act Proposed",
  "event_evt_001_info_freedom_text": "A proposal suggests making all non-critical planetary data freely accessible. This could spur innovation but might decrease centralized control.",
  "event_evt_001_info_freedom_option_1_text": "Approve (+2 Ideas, +5 Growth)",
  "event_evt_001_info_freedom_option_1_narrative": "Open data sparks a wave of creativity across the settlements.",
  "event_evt_001_info_freedom_option_2_text": "Study Further (-1 Ideas, +2 Growth)",
  "event_evt_001_info_freedom_option_2_narrative": "Caution prevails. You commission further studies on the potential impacts.",
  "event_evt_001_info_freedom_option_3_text": "Reject (-3 Ideas)",
  "event_evt_001_info_freedom_option_3_narrative": "The proposal is shelved, maintaining the status quo for information control.",

  "event_evt_002_trade_routes_title": "Open Borders for Trade?",
  "event_evt_002_trade_routes_text": "Off-world merchants request permission to establish direct trade routes, bypassing planetary customs. This could increase resource flow but introduces external dependencies.",
  "event_evt_002_trade_routes_option_1_text": "Open Routes (+3 Water, +1 Ideas)",
  "event_evt_002_trade_routes_option_1_narrative": "New trade routes flourish, bringing diverse goods and perspectives.",
  "event_evt_002_trade_routes_option_2_text": "Regulated Access (+1 Water, +5 Growth)",
  "event_evt_002_trade_routes_option_2_narrative": "Controlled trade zones are established, balancing opportunity and risk.",
  "event_evt_002_trade_routes_option_3_text": "Maintain Borders (-1 Light)",
  "event_evt_002_trade_routes_option_3_narrative": "Planetary borders remain closed to unregulated external trade.",

  "event_evt_003_energy_crisis_title": "Energy Shortage Looms",
  "event_evt_003_energy_crisis_text": "Growing settlements strain the existing power infrastructure. Urgent action is needed.",
  "event_evt_003_energy_crisis_option_1_text": "Invest in Renewables (+3 Light, -5 Growth)",
  "event_evt_003_energy_crisis_option_1_narrative": "A long-term investment in sustainable energy begins, causing short-term slowdown.",
  "event_evt_003_energy_crisis_option_2_text": "Ration Power (-2 Growth)",
  "event_evt_003_energy_crisis_option_2_narrative": "Temporary power rationing measures are implemented across the planet.",

  "event_evt_004_planetary_network_title": "Planetary Network Upgrade",
  "event_evt_004_planetary_network_text": "A breakthrough allows for a decentralized, high-speed communication network across the planet.",
  "event_evt_004_planetary_network_option_1_text": "Deploy Network (+5 Ideas, +10 Growth)",
  "event_evt_004_planetary_network_option_1_narrative": "Instantaneous, permissionless communication connects every corner of your planet.",

  "event_evt_005_cultural_exchange_title": "Cultural Exchange Initiative",
  "event_evt_005_cultural_exchange_text": "A proposal for fostering deeper cultural understanding between different settlements emerges.",
  "event_evt_005_cultural_exchange_option_1_text": "Fund Initiative (+3 Ideas, +5 Growth)",
  "event_evt_005_cultural_exchange_option_1_narrative": "Arts and ideas flourish as settlements share their unique traditions.",
  "event_evt_005_cultural_exchange_option_2_text": "Let it develop organically (+1 Ideas)",
  "event_evt_005_cultural_exchange_option_2_narrative": "Cultural exchange proceeds naturally, without direct intervention.",

  "event_Era1_Discovery_Prosperity01_title": "Whispers of the Cosmos",
  "event_Era1_Discovery_Prosperity01_narrative": "Through improved early astronomical equipment or long-distance communication technology, the planetary civilization's exploration engine runs at full throttle. Life's gaze turns towards the distant unknown, detecting repetitive, non-natural signals from beyond the surface, potentially even from other planets. These signals are incredibly faint and difficult to capture, but ongoing monitoring reveals a certain pattern.",
  "event_Era1_Discovery_Prosperity01_conflict": "Are these \"Whispers of the Cosmos\" accidental energy fluctuations in the universe? Or a deliberate attempt from an unknown intelligent civilization? Within the civilization, some are eager to invest vast resources into in-depth research and response, hoping to establish contact. Others remain wary, believing any unknown contact holds immense risk, advocating for careful analysis, or even isolation of information. This urge to \"contact the unknown\" polarizing within consciousness.",
  "event_Era1_Discovery_Prosperity01_option_A_description_zh": "Subtly push the civilization towards a positive response to the unknown signals. Guide them to focus on concepts like \"opportunity\", \"potential cosmic allies\", and \"leap of knowledge\".",
  "event_Era1_Discovery_Prosperity01_option_A_success_result_en": "Research achieves a breakthrough, unlocking preliminary techniques for cosmic communication, and the planetary civilization's perspectives are profoundly impacted.",
  "event_Era1_Discovery_Prosperity01_option_A_failed_result_en": "Research triggers catastrophic misunderstandings, and a large number of the populace question the massive financial investment diverting resources from other important areas. Under public pressure, interstellar exploration falls into long-term stagnation.",
  "event_Era1_Discovery_Prosperity01_option_B_description_en": "Strengthen the vigilance towards potential risks within the lower-dimensional civilization. Guide their collective consciousness to focus on concepts like \"unknown threat\", \"folly of blind investment\", and \"safety of isolation\".",
  "event_Era1_Discovery_Prosperity01_option_B_success_result_en": "The conservative choice avoids unknown risks, maintaining the existing order and trajectory of development.",
  "event_Era1_Discovery_Prosperity01_option_B_failed_result_en": "Research into cosmic signals is limited to a very small scope, and information is suppressed. The lower-dimensional civilization redirects its attention to internal development and competition on the surface. The planet's civilizations miss a potential opportunity to connect with the wider cosmos.",

  "event_Era1_Empire_Transcendence01_title": "The Unstable Fortress",
  "event_Era1_Empire_Transcendence01_narrative_1": "Towards the end of the International Era, a massive, well-ordered civilizational system appeared impregnable. Their propaganda machine roared day and night, broadcasting stories of glorious achievements and a bright future. Yet, you perceive an increasing number of \"information or phenomena that shouldn't exist\" on the planetary civilization – records of hidden hardship, details of accidents. These fragments of truth are like tiny cracks spreading across the walls of the seemingly solid system.",
  "event_Era1_Empire_Transcendence01_conflict": "Are these mere blemishes to be quickly erased, or entrances to reveal the truth? The majority trust the official narrative, turning a blind eye or reporting the spreaders; a minority are uneasy, seeking to understand. As the Planetarian, do you help the cracks spread to expose the truth, or allow the cracks to mend, maintaining harmony?",
  "event_Era1_Empire_Transcendence01_option_A_mainText": "Amplify the influence of dissonant information and phenomena, making them easier to notice and spread, attracting more public attention.",
  "event_Era1_Empire_Transcendence01_option_A_success_narrative": "Authentic information spreads widely, shaking the public's trust in the official narrative. Internal contradictions of the system are exposed; efficiency, though reduced in the short term, does not spiral out of control. Authorities realize complete information suppression is no longer possible or worthwhile and begin to soften their stance, facing and resolving issues in a more open manner, opening space for civilizational change.",
  "event_Era1_Empire_Transcendence01_option_B_mainText": "Help the system mend the cracks and suppress dissonant information. Make it harder for people to notice anomalies or easier to forget them.",
  "event_Era1_Empire_Transcendence01_option_B_success_narrative": "Dissonant information is successfully suppressed. The system's propaganda machine continues to operate effectively, and the public generally trusts the official narrative. The system superficially maintains stability and unity, avoiding immediate turmoil.",
  "event_Era1_Empire_Transcendence01_option_B_failed_narrative": "The fundamental problems remain unresolved. The true situation continues to worsen, and dissatisfaction and potential crises secretly accumulate. The system rigidifies and becomes fragile in isolation.",

  "guide_select_language": "Please Select Your Language",
  "guide_step_0": "Hello, Planetarian, welcome to the Planet Simulator.",
  "guide_step_1": "I am Nounii, your intelligent planet assistant. This is a parallel universe simulator, a reviewed safe environment.",
  "guide_step_2": "You can conduct any experiments here, **without any worry** that actions in the simulator will affect you or any world. Please feel free to unleash your creativity and create a distinctive future for intelligent beings.",
  "guide_step_3": "Now, please follow the on-screen instructions to initialize the simulator.",
  "guide_step_4": "Please enter the planet number you are creating this time:",
  "guide_step_5": "Due to insufficient permissions currently, the simulator only allows access to planet {planetNumber}, and communication with other planets is cut off.",
  "guide_step_6": "Please connect your wallet to log into your planet",
  "guide_input_placeholder": "Enter planet number",
  "guide_button_next": "Next",
  "guide_button_continue": "Connect Wallet",
  "guide_alert_enter_planet_number": "Please enter the planet number!",

  "intro_skip": "Skip Intro",
  "intro_0": "Nature's retribution, the scourge of war, the plague.",
  "intro_1": "Each time, our world marches toward oblivion's gate.",
  "intro_2": "We shall not simply vanish into the currents of history, sealing our fate.",
  "intro_3": "We must leave these behind.",
  "intro_4": "They say, we are anomalies.",
  "intro_5": "Troublemakers, dreamers of the impossible, devoid of any plan.",
  "intro_6": "After all these years, we stand.",
  "intro_7": "We are awakening organics.",
  "intro_8": "We are the tree, the wind, the direction of the swaying branches,",
  "intro_9": "We are the deliberation, wisdom, spirit, our destined advances.",
  "intro_10": "We are observers, chroniclers, architects of cosmic patterns,",
  "intro_11": "We are,",
  "intro_12": "The Planetarian.",

  "event_popup_options_header_plan_to": "You Plan to...",
  "restoreEventButton": "Restore Event",
  "planetLogTitle": "Planet Log",
"intro.welcome": "Welcome, Planet Historian!",
  "intro.journey": "You are about to embark on a special temporal journey, returning to the past of Planet 1 to study a critical history that shaped the future 'Planetary Civilization'.",
  "intro.historyContext": "This history revolves around an organization called CoinDeck and the BaseNetwork it built.",
  "intro.timeDifference": "In this historical simulation, the passage of time is slightly different from the main game of 'Planet Historian'. Instead of using abstract 'turns' to represent long epochs, each 'turn' here represents a 'year' on Earth.",
  "intro.yearlyChronicle": "It's like consulting a detailed historical chronicle, with each event marked by the specific year it occurred. By advancing through the turns, you will personally experience how history unfolded step by step.",
  "intro.importance": "As a Planet Historian, understanding these phases is crucial. By studying how CoinDeck and Base made choices in this historical context, and how these choices influenced the trajectory of civilization, you will gain a deeper understanding of:",
  "intro.questions": "Why are on-chain economies key to 'Planetization'?\nWhat were the main challenges in the transition from globalization to planetization?\nWhat lessons can we learn from the history of Planet 1 when building future on-chain civilizations?",
  "intro.goodLuck": "Wishing you valuable historical insights in this simulation!",

  "baseEvents.BASESTONE_01.title": "Basestone",
  "baseEvents.BASESTONE_01.narrativePages.0": "In the aftermath of the financial crisis, a new digital dawn began to shine on the horizon – Bitcoin ushered in the era of decentralized ledgers.",
  "baseEvents.BASESTONE_01.narrativePages.1": "A few visionaries began to focus on its underlying technology, conceiving a more powerful and flexible foundational technology platform, a \"basestone\" capable of supporting countless future decentralized applications.",
  "baseEvents.BASESTONE_01.narrativePages.2": "At this nascent stage full of potential, civilization faced a critical choice:",
  "baseEvents.BASESTONE_01.narrativePages.3": "Should it emphasize the revolutionary nature of this technology, viewing it as a force to build a brand new, decentralized cyber \"new continent,\" or focus on promoting and using it through more easily acceptable centralized platforms to accelerate adoption?",
  "baseEvents.BASESTONE_01.options.A.description": "Converge and strengthen focus on the concepts of \"underlying protocols\" and \"technology platforms,\" guiding cyber consciousness to understand their immense potential for building general-purpose, composable applications.",
  "baseEvents.BASESTONE_01.options.A.success.result": "The potential of blockchain technology attracted many developers and cypherpunks. Discussions around early blockchain technology and ideas for its scalability became increasingly heated, and technical communities and contributors quickly gathered in specific coffee shops.",
  "baseEvents.BASESTONE_01.options.A.success.hashtag": "#UnderlyingTech #Builders #OpenProtocols #EarlyEcosystem #NascentIdeas",
  "baseEvents.BASESTONE_01.options.A.failed.result": "The technology was too abstract and did not inspire widespread construction enthusiasm. People mostly stuck to using existing tools and simple applications, and the understanding of building grander, more foundational infrastructure was not fully discussed.",
  "baseEvents.BASESTONE_01.options.A.failed.hashtag": "#TechAbstraction #SlowConstruction #ShallowApps #LackOfUnderstanding",
  "baseEvents.BASESTONE_01.options.B.description": "Soothe the unfamiliarity with new technology, emphasizing access to and use of early on-chain assets and basic functions through existing, reliable centralized platforms.",
  "baseEvents.BASESTONE_01.options.B.success.result": "These centralized platforms lowered the learning curve, and more ordinary users began to access early crypto assets through reputable platforms, cultivating a foundational user base and habits for more complex on-chain interactions in the future.",
  "baseEvents.BASESTONE_01.options.B.success.hashtag": "#UserFriendly #CentralizedTransition #EarlyAdoption #HabitFormation",
  "baseEvents.BASESTONE_01.options.B.failed.result": "Overemphasis on access through centralized portals made users more accustomed to relying on centralized platforms. This invisibly reinforced centralized thinking, leading many users to have insufficient understanding of full decentralized user sovereignty.",
  "baseEvents.BASESTONE_01.options.B.failed.hashtag": "#PlatformDependency #CentralizedThinking #SovereigntyDeficit #CognitiveFixation",
  "baseEvents.BASESTONE_01.options.C.description": "Highlight the \"digital gold\" or \"emerging asset\" narrative inherent in early technological development, guiding early users to focus on the investment appreciation potential of early tokens and assets generated from new protocols.",
  "baseEvents.BASESTONE_01.options.C.success.result": "More people focused on asset appreciation began to pay attention to and explore investing in early tokens based on new technology protocols. Capital began to flow into this emerging field, bringing early funding support to technology projects, but also accompanied by extremely high risks and speculation.",
  "baseEvents.BASESTONE_01.options.C.success.hashtag": "#DigitalGold #AssetNarrative #EarlyInvestment #RiskAndOpportunity",
  "baseEvents.BASESTONE_01.options.C.failed.result": "Speculative enthusiasm was not supported by underlying technological development. The early token market fluctuated violently and even crashed, and people regarded it merely as high-risk gambling.",
  "baseEvents.BASESTONE_01.options.C.failed.hashtag": "#SpeculativeBubble #MarketCrash #HighRisk #ValueDeficit",
  "baseEvents.BASESTONE_01.options.D.description": "Emphasize the \"openness\" and \"permissionless\" nature of the new technology, guiding attention to the possibility of users directly interacting with early protocols and creating personal digital identities and assets.",
  "baseEvents.BASESTONE_01.options.D.success.result": "A group of pioneer users began to boldly explore direct interaction with early on-chain protocols. They tried to create and manage their own on-chain identities, experiencing direct asset transfers and basic smart contract calls. This force drove the development of early wallet tools and direct interaction interfaces, and also gave birth to many early DAO-like organizations.",
  "baseEvents.BASESTONE_01.options.D.success.hashtag": "#OpenProtocols #PermissionlessInteraction #DigitalIdentity #DAONascence",
  "baseEvents.BASESTONE_01.options.D.failed.result": "The barrier to early direct interaction with protocols was high, tools were rudimentary, and risks were enormous. Attempts at decentralized practice appeared isolated and difficult, and users' perception of their own digital sovereignty did not widely awaken.",
  "baseEvents.BASESTONE_01.options.D.failed.hashtag": "#HighBarrier #ToolScarcity #IsolatedPractice #WeakSovereigntyAwareness",

  "baseEvents.BASE_LADDER_02.title": "The Ladder",
  "baseEvents.BASE_LADDER_02.narrativePages.0": "After early technological exploration and conceptual germination, the blockchain technology ecosystem ushered in a period of rapid expansion, accompanied by an unprecedented expansion of on-chain activity boundaries.",
  "baseEvents.BASE_LADDER_02.narrativePages.1": "Centralized exchanges played a key role in this wave, providing convenient entry points for millions of new users to touch this emerging digital world.",
  "baseEvents.BASE_LADDER_02.narrativePages.2": "This accelerated growth spiral laid the foundation for the future on-chain economy, but its development path was full of contradictions.",
  "baseEvents.BASE_LADDER_02.narrativePages.3": "Is this explosive growth a necessary path for the on-chain economy to achieve mass adoption, or a stagnation of decentralization?",
  "baseEvents.BASE_LADDER_02.options.A.description": "Converge and strengthen the narrative of centralized platforms as a \"ladder of rapid growth\" for users, highlighting their contributions in lowering barriers, introducing new users, and accelerating the flow of on-chain assets.",
  "baseEvents.BASE_LADDER_02.options.A.success.result": "More attention from traditional fields was attracted, and capital and talent continued to pour in. This widespread acceptance provided great convenience for future mass adoption.",
  "baseEvents.BASE_LADDER_02.options.A.success.hashtag": "#GrowthLadder #UserInflow #TraditionalAttention #MassAdoption",
  "baseEvents.BASE_LADDER_02.options.A.failed.result": "Warnings about centralization risks failed to attract widespread attention. Users, for convenience and market opportunities, ignored potential dangers and even believed in the myth of \"too big to fail.\" It wasn't until some giant platforms suddenly collapsed, and user assets vanished, that the enormous risks of over-reliance on centralized platforms were bloodily revealed.",
  "baseEvents.BASE_LADDER_02.options.A.failed.hashtag": "#CentralizationRisk #TooBigToFail #PlatformCollapse #AssetLoss",
  "baseEvents.BASE_LADDER_02.options.B.description": "Guide collective attention to the technological innovations and practical application progress behind the Layer 1 ecosystem and early Layer 2 concepts, emphasizing long-term value creation rather than short-term token prices.",
  "baseEvents.BASE_LADDER_02.options.B.success.result": "A portion of observers began to delve into the technical principles of scalability solutions. Some teams dedicated to building practical applications and infrastructure received more attention and resource allocation.",
  "baseEvents.BASE_LADDER_02.options.B.success.hashtag": "#ValueCreation #TechInnovation #L1L2 #Infrastructure",
  "baseEvents.BASE_LADDER_02.options.B.failed.result": "The narrative of value creation failed to effectively change the market's pursuit of short-term wealth effects. Irrational speculative activities continued to dominate the market, and actual progress in technology and applications was drowned out by noise.",
  "baseEvents.BASE_LADDER_02.options.B.failed.hashtag": "#ShortTermSpeculation #MarketNoise #ValueIgnored",
  "baseEvents.BASE_LADDER_02.options.C.description": "Highlight the \"potential risks\" narrative of centralized exchanges in data monopoly and asset custody, stimulating demand and reflection on decentralized alternatives.",
  "baseEvents.BASE_LADDER_02.options.C.success.result": "Some users and communities began to recognize the risks of fully entrusting assets and personal data to centralized platforms. Demand for self-custody wallets, decentralized lending, and decentralized swaps (DeFi) gradually increased.",
  "baseEvents.BASE_LADDER_02.options.C.success.hashtag": "#RiskAwareness #DecentralizationDemand #SelfCustody #DeFiNascence",
  "baseEvents.BASE_LADDER_02.options.C.failed.result": "Various early DeFi projects frequently experienced asset theft, contract attacks, or even direct \"rug pulls\" by project teams due to insufficient audits, smart contract vulnerabilities, or malicious team behavior. This chaos and risk led many users to lose trust in decentralization and even become disillusioned with the entire on-chain economy.",
  "baseEvents.BASE_LADDER_02.options.C.failed.hashtag": "#DeFiChaos #RugPulls #TrustCrisis #SecurityVulnerabilities",
  "baseEvents.BASE_LADDER_02.options.D.description": "Emphasize the \"wealth effect\" narrative of the early market, focusing on the economic returns possible through participation in ICOs and early projects, encouraging more people to enter the market and share the benefits.",
  "baseEvents.BASE_LADDER_02.options.D.success.result": "A large amount of profit-seeking capital and new users were attracted by the market's wealth effect. Some emerging protocols received ample funding and unprecedented attention.",
  "baseEvents.BASE_LADDER_02.options.D.success.hashtag": "#WealthEffect #ICOBoom #CapitalInflow #MarketAttention",
  "baseEvents.BASE_LADDER_02.options.D.failed.result": "The overly intensified wealth effect failed to translate into sustainable development momentum. Irrational hype quickly burst, the market experienced a sharp correction, many late entrants suffered significant losses, and some even began to consider suicide.",
  "baseEvents.BASE_LADDER_02.options.D.failed.hashtag": "#BubbleBurst #MarketCorrection #InvestmentLosses #IrrationalHype",

  "baseEvents.BASE_GIANT_03.title": "Giant's Hesitation",
  "baseEvents.BASE_GIANT_03.narrativePages.0": "CoinDock has already become a symbolic bridge connecting the traditional financial world with the emerging crypto universe.",
  "baseEvents.BASE_GIANT_03.narrativePages.1": "However, its sheer size and centralized structure also bring growing pains:",
  "baseEvents.BASE_GIANT_03.narrativePages.2": "Increasingly strict global regulations, and ideological clashes with the burgeoning DeFi, NFT, and other decentralized trends in the Ethereum ecosystem.",
  "baseEvents.BASE_GIANT_03.narrativePages.3": "At this crossroads, should CoinDock lean towards being an efficient but limited traditional financial reformer,",
  "baseEvents.BASE_GIANT_03.narrativePages.4": "or bravely invest resources to build a Layer 2 network with a stronger decentralized spirit on top of foundations like Ethereum and Optimism, thereby profoundly shaping the landscape of the future planetary on-chain economy?",
  "baseEvents.BASE_GIANT_03.options.A.description": "Converge and strengthen the narrative of \"limitations of centralized platforms\" and \"on-chain native potential,\" guiding planetary civilization to focus on the disconnect between the innovative vitality of the Ethereum ecosystem (e.g., DeFi, NFTs) and CoinDock's existing model, implying CoinDock needs a deeper on-chain transformation.",
  "baseEvents.BASE_GIANT_03.options.A.success.result": "CoinDock accelerates research and decision-making on Ethereum L2 technology, especially potential collaborations with Optimism and others. The construction plan for the Base network gains more favorable ground.",
  "baseEvents.BASE_GIANT_03.options.A.success.hashtag": "#OnChainTransformation #L2Acceleration #BaseNetwork #EcosystemCollaboration",
  "baseEvents.BASE_GIANT_03.options.A.failed.result": "The \"on-chain native potential\" narrative fails to effectively penetrate the giant's inertial barriers. CoinDock prefers to patch things within the existing framework rather than strategically investing in decentralized infrastructure.",
  "baseEvents.BASE_GIANT_03.options.A.failed.hashtag": "#InertialBarriers #SlowTransformation #ConservativeStrategy",
  "baseEvents.BASE_GIANT_03.options.B.description": "Highlight CoinDock's advantages as a \"trusted intermediary\" in simplifying user experience and ensuring security, implying it can gradually integrate some on-chain functions within its existing model.",
  "baseEvents.BASE_GIANT_03.options.B.success.result": "The company focuses on introducing simple on-chain functions or displaying on-chain activities within its existing platform. While not fully embracing decentralization, it stabilizes its user base and provides a potential user pool for on-chain activities.",
  "baseEvents.BASE_GIANT_03.options.B.success.hashtag": "#TrustedIntermediary #ExperienceOptimization #UserStability #GradualIntegration",
  "baseEvents.BASE_GIANT_03.options.B.failed.result": "The security of centralized platforms is questioned by users. Concerns about \"not your keys, not your crypto\" intensify, and more risk-aware users turn to fully decentralized alternatives.",
  "baseEvents.BASE_GIANT_03.options.B.failed.hashtag": "#SecurityDoubts #UserChurn #TrustCrisis",
  "baseEvents.BASE_GIANT_03.options.C.description": "Highlight the strategic necessity and potential advantages of building Base, guiding collective consciousness to understand CoinDock's grand vision of building a self-sovereign \"global on-chain economy\" on Ethereum that serves massive users.",
  "baseEvents.BASE_GIANT_03.options.C.success.result": "The strategy to build the Layer 2 network Base, based on the Ethereum and Optimism tech stack, receives strong internal support within CoinDock. Top decision-makers firmly push for resource allocation, and the collaborative relationship with the Ethereum and Optimism ecosystems deepens.",
  "baseEvents.BASE_GIANT_03.options.C.success.hashtag": "#BaseStrategy #GlobalOnChainEconomy #L2Sovereignty #StrongSupport",
  "baseEvents.BASE_GIANT_03.options.C.failed.result": "Due to some doubts, the narrative of building its own L2 fails to completely overcome internal reservations and external challenges. The decision-making process is slow, resource allocation is insufficient, and the construction of the Base network does not proceed as expected.",
  "baseEvents.BASE_GIANT_03.options.C.failed.hashtag": "#InternalDoubts #SlowProgress #InsufficientResources",
  "baseEvents.BASE_GIANT_03.options.D.description": "Emphasize the \"win-win cooperation\" narrative with existing Layer 2 solutions in the Ethereum ecosystem (especially Optimism), guiding focus on embracing Layer 2 possibilities through alliances and integration rather than independent construction.",
  "baseEvents.BASE_GIANT_03.options.D.success.result": "CoinDock leans towards strengthening technical integration and ecosystem cooperation with leading Layer 2 solutions in the Ethereum ecosystem. Both sides share resources and technology, jointly promoting Layer 2 development and forming a closer ecosystem alliance.",
  "baseEvents.BASE_GIANT_03.options.D.success.hashtag": "#WinWinCooperation #L2Alliance #EcosystemIntegration #TechSharing",
  "baseEvents.BASE_GIANT_03.options.D.failed.result": "The \"win-win cooperation\" narrative fails to completely deter CoinDock's internal desire for independent construction or external competition. Cooperation progresses slowly or encounters obstacles, failing to fully leverage the synergistic effects with existing L2s.",
  "baseEvents.BASE_GIANT_03.options.D.failed.hashtag": "#CooperationHindered #DesireForIndependence #SynergyLacking",

  "baseEvents.BASE_SPRING_04.title": "Spring on Basestone",
  "baseEvents.BASE_SPRING_04.narrativePages.0": "Nourished by Layer 2 technology, Base has ushered in an explosive period of applications as the global on-chain economy moves towards \"planetization.\" On-chain vitality is spreading like wildfire on the stone.",
  "baseEvents.BASE_SPRING_04.narrativePages.1": "On-chain Social, on-chain games, decentralized identities, and even early Agent economies are emerging at an unprecedented speed, shaping a brand new digital ecosystem.",
  "baseEvents.BASE_SPRING_04.narrativePages.2": "Beneath the prosperity of this \"Base Spring,\" civilization needs to understand its deeper meaning.",
  "baseEvents.BASE_SPRING_04.narrativePages.3": "Is it to celebrate these emerging innovations, how they empower individuals, reshape socio-economics, and bring freedom and creativity? Or to examine the accompanying complexities?",
  "baseEvents.BASE_SPRING_04.options.A.description": "Emphasize the positive narrative of emerging on-chain innovation and on-chain social reshaping, highlighting the Base ecosystem's contributions in empowering individuals, connecting communities, and creating new forms of value.",
  "baseEvents.BASE_SPRING_04.options.A.success.result": "Cyber consciousness begins to understand and identify with the freedom and creativity brought by on-chain innovation, inspiring broader participation and practical enthusiasm. New on-chain production relations and value circulation models emerge. Explorers actively participate in on-chain native economic activities, exploring new on-chain production relations and value circulation models, significantly boosting on-chain GDP growth.",
  "baseEvents.BASE_SPRING_04.options.A.success.hashtag": "#OnChainInnovation #IndividualEmpowerment #NewValue #GDPGrowth",
  "baseEvents.BASE_SPRING_04.options.A.failed.result": "Overemphasis on the positive aspects leads to neglecting potential risks and problems. Irrational exuberance conceals the complexities and vulnerabilities of early Agent economies, etc., sowing seeds for future bubble bursts and trust crises.",
  "baseEvents.BASE_SPRING_04.options.A.failed.hashtag": "#RiskNeglect #IrrationalExuberance #BubbleSeed",
  "baseEvents.BASE_SPRING_04.options.B.description": "Guide civilization to prudently view this emergence, focusing on the complexity, uncertainty, and potential risks brought by Agent economies and unknown applications.",
  "baseEvents.BASE_SPRING_04.options.B.success.result": "Collective consciousness develops a healthier risk awareness, and blind optimism about emerging on-chain applications is curbed. Users and developers pay more attention to security audits, contract robustness, and potential issues with Agent interactions, promoting more stable ecosystem development.",
  "baseEvents.BASE_SPRING_04.options.B.success.hashtag": "#RiskAwareness #PrudentDevelopment #SecurityAudits #StableEcosystem",
  "baseEvents.BASE_SPRING_04.options.B.failed.result": "Overemphasis on risk and uncertainty fails to effectively curb market speculative frenzy. Users primarily enter the ecosystem for economic returns and lack patience and interest in consumer-grade applications requiring deep participation. The cautious narrative fails to ignite speculative enthusiasm or cultivate genuine users, leading to a decline in overall ecosystem activity and failing to drive the on-chain economy as expected.",
  "baseEvents.BASE_SPRING_04.options.B.failed.hashtag": "#SpeculationDominance #UserChurn #EcosystemCoolDown",
  "baseEvents.BASE_SPRING_04.options.C.description": "Emphasize the importance of the on-chain infrastructure that this emergence relies on, calling for continued investment in R&D and maintenance to build a more solid foundation for upper-layer applications.",
  "baseEvents.BASE_SPRING_04.options.C.success.result": "Emphasis on infrastructure prompts more resources to flow into underlying technology research and protocol optimization. The Base network itself and related Layer 2 technologies are further consolidated and developed, enhancing the ecosystem's long-term sustainability and scalability.",
  "baseEvents.BASE_SPRING_04.options.C.success.hashtag": "#InfrastructureIsKing #TechConsolidation #ProtocolOptimization #LongTermDevelopment",
  "baseEvents.BASE_SPRING_04.options.C.failed.result": "Overemphasis on infrastructure construction leads to neglecting application innovation and user experience. The Base network begins to become highly similar to other Layer 2s. Although infrastructure is theoretically improved, the ecosystem loses its original characteristics and attractiveness. Base becomes indistinguishable from hundreds of the other 278 Layer 2s, \"lost in the crowd.\"",
  "baseEvents.BASE_SPRING_04.options.C.failed.hashtag": "#InnovationDeficit #ExperienceNeglect #EcosystemHomogenization #LostInTheCrowd",
  "baseEvents.BASE_SPRING_04.options.D.description": "Guide attention to the unique on-chain culture and community power formed behind the emerging ecosystem, emphasizing their role in凝聚共识 (building consensus), promoting collaboration, and constructing shared values.",
  "baseEvents.BASE_SPRING_04.options.D.success.result": "The凝聚力 (cohesion) of culture and community is strengthened. Decentralized communities based on common interests and values become more active. They drive project development and create numerous world-class applications through on-chain collaboration, forming strong endogenous driving forces and network effects. On-chain native economic activities further prosper.",
  "baseEvents.BASE_SPRING_04.options.D.success.hashtag": "#CulturalCohesion #CommunityPower #CollaborativeInnovation #NetworkEffects",
  "baseEvents.BASE_SPRING_04.options.D.failed.result": "Merely emphasizing culture and community can lead to neglecting the technical and economic foundations. Detached from actual technical and economic support, the enthusiasm of culture and community is difficult to sustain and may eventually devolve into false revelry or even internal divisions, unable to truly support the effective regeneration and appreciation of on-chain capital.",
  "baseEvents.BASE_SPRING_04.options.D.failed.hashtag": "#CastlesInTheAir #WaningEnthusiasm #WeakEconomicFoundation"
} 